lockekk/dshare-hid/src/lib/gui/widgets/Esp32HidToolsWidget.cpp
/*
 * dshare-hid -- created by locke.huang@gmail.com
 */

#include "Esp32HidToolsWidget.h"
#include "base/Log.h"
#include <QApplication>
#include <QClipboard>
#include <QDateTime>
#include <QDesktopServices>
#include <QDir>
#include <QEvent>
#include <QFile>
#include <QFileDialog>
#include <QFutureWatcher>
#include <QGroupBox>
#include <QHBoxLayout>
#include <QJsonDocument>
#include <QJsonObject>
#include <QMessageBox>
#include <QNetworkAccessManager>
#include <QNetworkReply>
#include <QNetworkRequest>
#include <QScrollBar>
#include <QSplitter>
#include <QStandardPaths>
#include <QUrl>
#include <QUrlQuery>
#include <QVBoxLayout>
#include <QtConcurrent>

// Include the C++ API from the submodule
#include "components/downloader/github_downloader.h"
#include "devices/UsbDeviceHelper.h"
#include "flash_tool.h"

#include "platform/bridge/CdcTransport.h"

namespace deskflow::gui {

Esp32HidToolsWidget::Esp32HidToolsWidget(const QString &devicePath, QWidget *parent)
    : QDialog(parent),
      m_devicePath(devicePath),
      m_isTaskRunning(false),
      // Default Fallback Prices (Hardcoded)
      m_prices{9.99, 3.99, 4.99, 1.99},
      m_network(new QNetworkAccessManager(this))
{
  // We can't log "this" easily unless we cast or format it, but usually devicePath suffices
  LOG_INFO("GUI of tool widget is created for device: %s", qPrintable(devicePath));
  QString title = tr("Firmware Flash Tool");
#ifdef DESKFLOW_USE_GENERATED_PUBLIC_KEY
  title += " (Dev build)";
#endif

  if (devicePath.isEmpty()) {
    setWindowTitle(title);
  } else {
    setWindowTitle(QString("%1 - %2").arg(title, devicePath));
  }
  resize(750, 1000);

  auto *mainLayout = new QVBoxLayout(this);

  // --- Port Selection ---
  auto *portLayout = new QHBoxLayout();
  m_portCombo = new QComboBox();
  m_portCombo->setEditable(true); // Allow manual entry if needed
  m_portCombo->setMinimumWidth(200);
  m_refreshPortsBtn = new QPushButton(tr("Refresh"));
  portLayout->addWidget(new QLabel(tr("Port:")));
  portLayout->addWidget(m_portCombo, 1);
  portLayout->addWidget(m_refreshPortsBtn);

  mainLayout->addLayout(portLayout);

  m_tabWidget = new QTabWidget();
  m_tabWidget->setMinimumHeight(100); // Allow shrinking below content hint
  m_tabWidget->setParent(this);

  // --- Factory Tab ---
  auto *factoryTab = new QWidget();
  auto *factoryLayout = new QVBoxLayout(factoryTab);

#ifdef _WIN32
  auto *bootReminderLbl = new QLabel(tr(
      "Reminder: Press 'Boot' button then plugin your ESP32-C3. Click Refresh button to ensure the device is detected."
  ));
  bootReminderLbl->setStyleSheet("color: blue; font-weight: bold;");
  bootReminderLbl->setWordWrap(true);
  factoryLayout->addWidget(bootReminderLbl);
#endif

  // --- Online Factory Group ---
  auto *onlineFactoryGroup = new QGroupBox(tr("Online"));
  auto *onlineFactoryLayout = new QVBoxLayout(onlineFactoryGroup);

  m_downloadFlashBtn = new QPushButton(tr("Flash"));
  auto *onlineFactoryBtnLayout = new QHBoxLayout();
  onlineFactoryBtnLayout->addWidget(m_downloadFlashBtn);
  onlineFactoryBtnLayout->addStretch();
  onlineFactoryLayout->addLayout(onlineFactoryBtnLayout);

  // --- Manual Factory Group ---
  auto *manualFactoryGroup = new QGroupBox(tr("Manual"));
  auto *manualFactoryLayout = new QVBoxLayout(manualFactoryGroup);

  auto *factoryInputLayout = new QHBoxLayout();
  m_factoryPathEdit = new QLineEdit();
  m_factoryPathEdit->setPlaceholderText(tr("Path to factory.fzip"));
  m_factoryBrowseBtn = new QPushButton(tr("Browse..."));
  factoryInputLayout->addWidget(new QLabel(tr("File:")));
  factoryInputLayout->addWidget(m_factoryPathEdit);
  factoryInputLayout->addWidget(m_factoryBrowseBtn);

  m_factoryFlashBtn = new QPushButton(tr("Flash"));

  auto *manualBtnLayout = new QHBoxLayout();
  manualBtnLayout->addWidget(m_factoryFlashBtn);
  manualBtnLayout->addStretch();

  manualFactoryLayout->addLayout(factoryInputLayout);
  manualFactoryLayout->addLayout(manualBtnLayout);

  factoryLayout->addWidget(onlineFactoryGroup);
  factoryLayout->addWidget(manualFactoryGroup);

  factoryLayout->addStretch();

  m_tabWidget->addTab(factoryTab, tr("Factory Mode"));

  // --- Upgrade Tab ---
  auto *upgradeTab = new QWidget();
  auto *upgradeLayout = new QVBoxLayout(upgradeTab);

  // --- Online Upgrade Group ---
  auto *onlineGroup = new QGroupBox(tr("Online"));
  auto *onlineLayout = new QVBoxLayout(onlineGroup);

  auto *verLayout = new QHBoxLayout();
  m_lblCurrentVersion = new QLabel(tr("Current Version: Unknown"));
  m_lblLatestVersion = new QLabel(tr("Latest Version: Unknown"));
  verLayout->addWidget(m_lblCurrentVersion);
  verLayout->addSpacing(20);
  verLayout->addWidget(m_lblLatestVersion);
  verLayout->addStretch();

  auto *onlineBtnLayout = new QHBoxLayout();
  m_checkUpgradeBtn = new QPushButton(tr("Check for Updates"));
  m_flashOnlineBtn = new QPushButton(tr("Flash"));
  m_flashOnlineBtn->setEnabled(false); // Enabled after check
  onlineBtnLayout->addWidget(m_checkUpgradeBtn);
  onlineBtnLayout->addWidget(m_flashOnlineBtn);
  onlineBtnLayout->addStretch();

  onlineLayout->addLayout(verLayout);

  onlineLayout->addLayout(onlineBtnLayout);

  // --- Manual Upgrade Group ---
  auto *manualGroup = new QGroupBox(tr("Manual"));
  auto *manualLayout = new QVBoxLayout(manualGroup);

  auto *manualInputLayout = new QHBoxLayout();
  m_upgradePathEdit = new QLineEdit();
  m_upgradePathEdit->setPlaceholderText(tr("Path to upgrade.uzip"));
  m_upgradeBrowseBtn = new QPushButton(tr("Browse..."));
  manualInputLayout->addWidget(new QLabel(tr("File:")));
  manualInputLayout->addWidget(m_upgradePathEdit);
  manualInputLayout->addWidget(m_upgradeBrowseBtn);

  auto *manualActionLayout = new QHBoxLayout();
  m_flashLocalBtn = new QPushButton(tr("Flash"));
  manualActionLayout->addWidget(m_flashLocalBtn);
  manualActionLayout->addStretch();

  manualLayout->addLayout(manualInputLayout);
  manualLayout->addLayout(manualActionLayout);

  upgradeLayout->addWidget(onlineGroup);
  upgradeLayout->addWidget(manualGroup);
  upgradeLayout->addStretch();

  m_tabWidget->addTab(upgradeTab, tr("Upgrade Mode"));

  // --- Activation Tab ---
  auto *activationTab = new QWidget();
  auto *activationLayout = new QVBoxLayout(activationTab);

  // Status Section
  auto *statusLayout = new QHBoxLayout();
  m_labelActivationState = new QLabel(tr("State: Unknown"));
  QFont stateFont = m_labelActivationState->font();
  stateFont.setBold(true);

