lockekk/dshare-hid/src/lib/gui/widgets/Esp32HidToolsWidget.cpp
  m_labelActivationState->setFont(stateFont);
  statusLayout->addWidget(m_labelActivationState);

  statusLayout->addStretch();
  statusLayout->addWidget(new QLabel(tr("Serial:")));
  m_lineSerial = new QLabel(tr("-"));
  m_lineSerial->setTextInteractionFlags(Qt::TextSelectableByMouse); // Allow manual selection
  QFont serialFont = m_lineSerial->font();
  serialFont.setFamily("Monospace"); // Use monospace for serial/MAC
  m_lineSerial->setFont(serialFont);
  statusLayout->addWidget(m_lineSerial);
  m_btnCopySerial = new QPushButton(tr("Copy Serial"));
  statusLayout->addWidget(m_btnCopySerial);

  // Activation Input Section
  m_groupActivationInput = new QWidget();
  auto *licenseLayout = new QHBoxLayout(m_groupActivationInput);
  licenseLayout->setContentsMargins(0, 0, 0, 0);
  m_lineActivationKey = new QLineEdit();
  m_lineActivationKey->setPlaceholderText(tr("Paste Activation Key Here"));
  m_btnActivate = new QPushButton(tr("Activate"));
  licenseLayout->addWidget(new QLabel(tr("Activation Key:")));
  licenseLayout->addWidget(m_lineActivationKey);
  licenseLayout->addWidget(m_btnActivate);

  activationLayout->addLayout(statusLayout);
  activationLayout->addWidget(m_groupActivationInput);
  activationLayout->addStretch();

  m_tabWidget->addTab(activationTab, tr("Activation"));

  // --- Order Tab ---
  auto *orderTab = new QWidget();
  orderTab->setMinimumHeight(100); // Allow shrinking below content hint
  auto *orderLayout = new QVBoxLayout(orderTab);

  // User Info
  auto *userInfoGroup = new QGroupBox(tr("User Information"));
  auto *userInfoLayout = new QGridLayout(userInfoGroup);
  m_orderName = new QLineEdit();
  m_orderEmail = new QLineEdit();
  userInfoLayout->addWidget(new QLabel(tr("Name:")), 0, 0);
  userInfoLayout->addWidget(m_orderName, 0, 1);
  userInfoLayout->addWidget(new QLabel(tr("Email:")), 1, 0);
  userInfoLayout->addWidget(m_orderEmail, 1, 1);

  // Options
  auto *optionsGroup = new QGroupBox(tr("Order Options"));
  auto *optionsLayout = new QVBoxLayout(optionsGroup);
  m_orderOption2 = new QRadioButton(tr("Purchase Full License"));
  m_orderOption4 = new QRadioButton(tr("Upgrade Profile Capacity"));
  optionsLayout->addWidget(m_orderOption2);
  optionsLayout->addWidget(m_orderOption4);

  // Payments Group
  auto *paymentsGroup = new QGroupBox(tr("Payments"));
  auto *paymentsLayout = new QGridLayout(paymentsGroup);

  // Cost
  m_lblPaymentDetails = new QLabel(tr("Payment Details: Free Trial ($0.00)"));
  QFont fontPayment = m_lblPaymentDetails->font();
  fontPayment.setBold(true);
  m_lblPaymentDetails->setFont(fontPayment);

  // Reference NO
  m_paymentRefNo = new QLineEdit();
  m_paymentRefNo->setReadOnly(true);
  m_paymentRefNo->setToolTip(tr("Please put this Reference No. in your PayPal payment message/note."));

  m_paymentTransId = new QLineEdit();
  m_paymentTransId->setPlaceholderText(tr("Paste your PayPal Transaction ID here"));

  m_chkManualPayment = new QCheckBox(tr("I will arrange payment via email"));
  connect(m_chkManualPayment, &QCheckBox::toggled, this, [this](bool checked) {
    m_paymentTransId->setEnabled(!checked);
    m_btnPayNow->setEnabled(!checked);
    if (checked) {
      m_paymentTransId->setPlaceholderText(tr("Not required for manual payment"));
    } else {
      m_paymentTransId->setPlaceholderText(tr("Paste your PayPal Transaction ID here"));
    }
  });

#ifndef DESKFLOW_PAYPAL_ACCOUNT
#define DESKFLOW_PAYPAL_ACCOUNT "sb-uqhcf48362835@business.example.com"
#endif

  m_lblPaymentOwner =
      new QLabel(QString(tr("Paypal Seller: <b><font color='red'>%1</font></b>")).arg(DESKFLOW_PAYPAL_ACCOUNT));
  m_lblPaymentOwner->setTextInteractionFlags(Qt::TextSelectableByMouse); // Enable copy

  paymentsLayout->addWidget(m_lblPaymentDetails, 0, 0, 1, 2); // Span 2 cols
  paymentsLayout->addWidget(m_lblPaymentOwner, 1, 0, 1, 2);   // Span 2 cols
  paymentsLayout->addWidget(new QLabel(tr("Reference NO.:")), 2, 0);
  paymentsLayout->addWidget(m_paymentRefNo, 2, 1);

  paymentsLayout->addWidget(new QLabel(tr("PayPal Transaction ID:")), 3, 0);
  paymentsLayout->addWidget(m_paymentTransId, 3, 1);
  paymentsLayout->addWidget(m_chkManualPayment, 4, 0, 1, 2); // Span 2 cols

  m_btnPayNow = new QPushButton(tr("Pay Now (Secure PayPal Link)"));
  paymentsLayout->addWidget(m_btnPayNow, 5, 0, 1, 2);

  auto *deviceInfoGroup = new QGroupBox(tr("Device Information"));
  auto *deviceInfoLayout = new QGridLayout(deviceInfoGroup);
  m_orderSerialLabel = new QLabel(tr("-"));
  m_orderSerialLabel->setTextInteractionFlags(Qt::TextSelectableByMouse);
  m_orderTotalProfiles = new QComboBox();
  m_orderTotalProfiles->addItem("2", 2);
  m_orderTotalProfiles->addItem("4", 4);
  m_orderTotalProfiles->addItem("6", 6);

  deviceInfoLayout->addWidget(new QLabel(tr("Serial Number:")), 0, 0);
  deviceInfoLayout->addWidget(m_orderSerialLabel, 0, 1);
  deviceInfoLayout->addWidget(new QLabel(tr("Total Profiles:")), 1, 0);
  deviceInfoLayout->addWidget(m_orderTotalProfiles, 1, 1);

  m_btnCopyOrder = new QPushButton(tr("Copy content"));
  m_btnEmailOrder = new QPushButton(tr("Email"));

  auto *orderButtonLayout = new QHBoxLayout();
  orderButtonLayout->addWidget(m_btnCopyOrder);
  orderButtonLayout->addWidget(m_btnEmailOrder);

  orderLayout->addWidget(userInfoGroup);
  orderLayout->addWidget(optionsGroup);
  orderLayout->addWidget(deviceInfoGroup);
  orderLayout->addWidget(paymentsGroup);
  orderLayout->addLayout(orderButtonLayout);
  orderLayout->addStretch();

  m_tabWidget->addTab(orderTab, tr("Order"));

  // --- Common Output ---
  m_logOutput = new QTextEdit();
  m_logOutput->setReadOnly(true);

  m_splitter = new QSplitter(Qt::Vertical, this);
  m_splitter->addWidget(m_tabWidget);

  auto *logContainer = new QWidget();
  auto *logLayout = new QVBoxLayout(logContainer);
  logLayout->setContentsMargins(0, 0, 0, 0);
  logLayout->addWidget(new QLabel(tr("Log Output:")));
  logLayout->addWidget(m_logOutput);
  m_splitter->addWidget(logContainer);

  mainLayout->addWidget(m_splitter, 1);

  // Set initial sizes (top tabs small, bottom logs large)
  m_splitter->setSizes({300, 700});
  m_splitter->setStretchFactor(0, 0);
  m_splitter->setStretchFactor(1, 1);

