lockekk/dshare-hid/src/lib/gui/widgets/Esp32HidToolsWidget.cpp
  // Trigger initial layout adjustment
  onTabChanged(0);

  // Connect Signals
  connect(m_tabWidget, &QTabWidget::currentChanged, this, &Esp32HidToolsWidget::onTabChanged);

  connect(m_factoryBrowseBtn, &QPushButton::clicked, this, &Esp32HidToolsWidget::onBrowseFactory);
  connect(m_factoryFlashBtn, &QPushButton::clicked, this, &Esp32HidToolsWidget::onFlashFactory);
  connect(m_downloadFlashBtn, &QPushButton::clicked, this, &Esp32HidToolsWidget::onDownloadAndFlashFactory);

  connect(m_upgradeBrowseBtn, &QPushButton::clicked, this, &Esp32HidToolsWidget::onBrowseUpgrade);
  connect(m_checkUpgradeBtn, &QPushButton::clicked, this, &Esp32HidToolsWidget::onCheckUpgrade);
  connect(m_flashOnlineBtn, &QPushButton::clicked, this, &Esp32HidToolsWidget::onFlashOnline);
  connect(m_flashLocalBtn, &QPushButton::clicked, this, &Esp32HidToolsWidget::onFlashLocal);

  connect(m_btnCopySerial, &QPushButton::clicked, this, &Esp32HidToolsWidget::onCopySerialClicked);
  connect(m_btnActivate, &QPushButton::clicked, this, &Esp32HidToolsWidget::onActivateClicked);
  connect(m_btnCopyOrder, &QPushButton::clicked, this, &Esp32HidToolsWidget::onCopyOrderContent);
  connect(m_btnEmailOrder, &QPushButton::clicked, this, &Esp32HidToolsWidget::onEmailOrder);

  connect(m_refreshPortsBtn, &QPushButton::clicked, this, &Esp32HidToolsWidget::refreshPorts);
  connect(m_portCombo, QOverload<int>::of(&QComboBox::currentIndexChanged), this, &Esp32HidToolsWidget::onPortChanged);

  connect(m_orderOption2, &QRadioButton::toggled, this, &Esp32HidToolsWidget::updatePaymentDetails);
  connect(m_orderOption4, &QRadioButton::toggled, this, &Esp32HidToolsWidget::updatePaymentDetails);
  connect(
      m_orderTotalProfiles, QOverload<int>::of(&QComboBox::currentIndexChanged), this,
      &Esp32HidToolsWidget::updatePaymentDetails
  );

  // Update Reference No (Timestamp) - Call once or on specific triggers
  updatePaymentReference();

  connect(m_btnPayNow, &QPushButton::clicked, this, &Esp32HidToolsWidget::onPayNowClicked);

  updatePaymentDetails();
  refreshPorts();

  // Fetch prices
  fetchPrices();
}

void Esp32HidToolsWidget::fetchPrices()
{
  // 1. Check local override
  QString localPath =
      QStandardPaths::locate(QStandardPaths::AppConfigLocation, "prices.json", QStandardPaths::LocateFile);
  if (!localPath.isEmpty()) {
    QFile f(localPath);
    if (f.open(QIODevice::ReadOnly)) {
      QJsonDocument doc = QJsonDocument::fromJson(f.readAll());
      if (!doc.isNull() && doc.isObject()) {
        QJsonObject obj = doc.object();
        if (obj.contains("license"))
          m_prices.license = obj["license"].toDouble();
        if (obj.contains("profile_4"))
          m_prices.profile_4 = obj["profile_4"].toDouble();
        if (obj.contains("profile_6"))
          m_prices.profile_6 = obj["profile_6"].toDouble();
        if (obj.contains("combo_discount"))
          m_prices.combo_discount = obj["combo_discount"].toDouble();
        LOG_INFO("Loaded local prices override: %s", qPrintable(localPath));
        updatePaymentDetails();
        return; // Local override takes precedence
      }
    }
  }

  // 2. Fetch online
#ifdef DESKFLOW_PRICES_URL
  QString urlStr = DESKFLOW_PRICES_URL;
#else
  QString urlStr = "https://raw.githubusercontent.com/lockekk/esp32-hid-release/main/prices.json";
#endif

  LOG_INFO("Fetching prices from: %s", qPrintable(urlStr));
  QNetworkRequest req(urlStr);
  QNetworkReply *reply = m_network->get(req);
  connect(reply, &QNetworkReply::finished, this, [this, reply]() { onPriceResponse(reply); });
}

void Esp32HidToolsWidget::onPriceResponse(QNetworkReply *reply)
{
  reply->deleteLater();
  if (reply->error() != QNetworkReply::NoError) {
    LOG_WARN("Failed to fetch prices: %s", qPrintable(reply->errorString()));
    return;
  }

  QByteArray data = reply->readAll();
  QJsonDocument doc = QJsonDocument::fromJson(data);
  if (doc.isNull() || !doc.isObject()) {
    LOG_WARN("Invalid JSON prices response");
    return;
  }

  QJsonObject obj = doc.object();
  // Only update if value is present and valid
  if (obj.contains("license"))
    m_prices.license = obj["license"].toDouble();
  if (obj.contains("profile_4"))
    m_prices.profile_4 = obj["profile_4"].toDouble();
  if (obj.contains("profile_6"))
    m_prices.profile_6 = obj["profile_6"].toDouble();
  if (obj.contains("combo_discount"))
    m_prices.combo_discount = obj["combo_discount"].toDouble();

  LOG_INFO("Updated prices online: License=$%f, ComboDiscount=$%f", m_prices.license, m_prices.combo_discount);
  updatePaymentDetails(); // Refresh UI
}

void Esp32HidToolsWidget::refreshPorts()
{
  m_portCombo->clear();
  LOG_INFO("Refreshing ports...");
  // Only filter by VID/PID, don't try to read serial (avoids timeouts on stuck devices)
  auto devices = UsbDeviceHelper::getConnectedDevices(false);
  LOG_INFO("Found %d candidate devices.", devices.size());

  if (devices.isEmpty()) {
    m_portCombo->addItem(tr("No devices found"));
    LOG_WARN("No supported USB bridge devices found.");
    // logic to disable flash buttons?
  } else {
    for (auto it = devices.begin(); it != devices.end(); ++it) {
      QString path = it.key();
      QString serial = it.value();
      QString displayPath = path;
      if (displayPath.startsWith(QStringLiteral("\\\\.\\"))) {
        displayPath = displayPath.mid(4);
      }

      if (serial.isEmpty()) {
        LOG_INFO("Adding device: %s", qPrintable(path));
        m_portCombo->addItem(displayPath, path);
      } else if (serial == displayPath) {
        LOG_INFO("Adding device: %s (fallback serial)", qPrintable(path));
        m_portCombo->addItem(displayPath, path);
      } else {
        LOG_INFO("Adding device: %s Serial: %s", qPrintable(path), qPrintable(serial));
        m_portCombo->addItem(QString("%1 (%2)").arg(displayPath, serial), path);
      }
    }
  }

  // Try to select the device passed in constructor
  if (!m_devicePath.isEmpty()) {
    int index = m_portCombo->findData(m_devicePath);
    if (index >= 0) {
      m_portCombo->setCurrentIndex(index);
    } else {
      // Add it if not found (maybe it's not a "bridge" yet but user knows what they are doing)
      LOG_INFO("Device path from bridge client not in detected list, adding manually: %s", qPrintable(m_devicePath));
      m_portCombo->addItem(m_devicePath, m_devicePath);
      m_portCombo->setCurrentIndex(m_portCombo->count() - 1);
    }
  }
}

