lockekk/dshare-hid/src/lib/gui/widgets/Esp32HidToolsWidget.cpp
void Esp32HidToolsWidget::onBrowseFactory()
{
  QString path =
      QFileDialog::getOpenFileName(this, tr("Select Factory Package"), QString(), tr("Factory Package (*.fzip)"));
  if (!path.isEmpty()) {
    m_factoryPathEdit->setText(path);
    log(tr("Selected factory firmware: %1").arg(QFileInfo(path).fileName()));
  }
}

void Esp32HidToolsWidget::onBrowseUpgrade()
{
  QString path =
      QFileDialog::getOpenFileName(this, tr("Select Upgrade Package"), QString(), tr("Upgrade Package (*.uzip)"));
  if (!path.isEmpty()) {
    m_upgradePathEdit->setText(path);
    log(tr("Selected upgrade firmware: %1").arg(QFileInfo(path).fileName()));
  }
}

std::vector<uint8_t> Esp32HidToolsWidget::readFile(const QString &path)
{
  QFile file(path);
  if (!file.open(QIODevice::ReadOnly)) {
    return {};
  }
  QByteArray data = file.readAll();
  return std::vector<uint8_t>(data.begin(), data.end());
}

void Esp32HidToolsWidget::log(const QString &message)
{
  m_logOutput->append(message);
  QScrollBar *sb = m_logOutput->verticalScrollBar();
  sb->setValue(sb->maximum());
}

void Esp32HidToolsWidget::setControlsEnabled(bool enabled)
{
  m_factoryFlashBtn->setEnabled(enabled);
  m_downloadFlashBtn->setEnabled(enabled);
  m_flashOnlineBtn->setEnabled(enabled && m_onlineFlashAllowed);
  m_flashLocalBtn->setEnabled(enabled);
  m_factoryBrowseBtn->setEnabled(enabled);
  m_upgradeBrowseBtn->setEnabled(enabled);
  m_checkUpgradeBtn->setEnabled(enabled);
  m_refreshPortsBtn->setEnabled(enabled);
  m_portCombo->setEnabled(enabled);
  m_factoryPathEdit->setEnabled(enabled);
  m_upgradePathEdit->setEnabled(enabled);
}

// Helper to run tasks in background
template <typename Function> void Esp32HidToolsWidget::runBackgroundTask(Function func)
{
  setControlsEnabled(false);
  m_isTaskRunning = true;
  QApplication::setOverrideCursor(Qt::WaitCursor);

  auto *watcher = new QFutureWatcher<void>(this);
  connect(watcher, &QFutureWatcher<void>::finished, this, [this, watcher]() {
    QApplication::restoreOverrideCursor();
    setControlsEnabled(true);
    m_isTaskRunning = false;
    watcher->deleteLater();
  });

  QFuture<void> future = QtConcurrent::run(func);
  watcher->setFuture(future);
}

void Esp32HidToolsWidget::onFlashFactory()
{
  QString path = m_factoryPathEdit->text();
  QString portName = m_portCombo->currentData().toString();
  if (portName.isEmpty()) {
    portName = m_portCombo->currentText();
    if (portName.isEmpty() || portName == tr("No devices found")) {
      showWideMessageBox(QMessageBox::Warning, tr("Error"), tr("Please select a valid serial port."));
      return;
    }
  }

  std::vector<uint8_t> data;
  if (!path.isEmpty()) {
    log(tr("Reading factory firmware from: %1").arg(path));
    data = readFile(path);
    if (data.empty()) {
      log(tr("Error: Failed to read file or file is empty: %1").arg(path));
    }
  }

  if (!confirmFactoryFlash(path.isEmpty() ? "Unknown" : QFileInfo(path).fileName())) {
    return;
  }

  std::string port = portName.toStdString();

  log(tr("Checking device status..."));

  // Create a struct to hold result so we can capture it by value
  struct Result
  {
    FlashResult res;
    std::string info;
  };

  auto task = [this, port, data]() {
    std::string info;

    // Callback for progress/logging to update UI
    auto log_cb = [this](const std::string &msg) {
      QMetaObject::invokeMethod(this, [this, msg]() { log(QString::fromStdString(msg)); });
    };

    // Optionally we can throttle progress updates if needed, but for "brief" check we can just log major steps
    // or we could implement a progress bar. For now, logging everything to UI is what the user seems to lack.
    auto progress_cb = [this](size_t written, size_t total, size_t address) {
      // Just log every 10%
      static int last_percent = -1;
      int percent = total > 0 ? (int)(((float)written / total) * 100) : 0;
      if (percent % 10 == 0 && percent != last_percent) {
        last_percent = percent;
        QString msg = QString("Flashing... %1%").arg(percent);
        QMetaObject::invokeMethod(this, [this, msg]() { log(msg); });
      }
    };

    // Pre-check: Handshake must FAIL for Factory Flash (Device must be in valid Bootloader mode, not Firmware mode)
    {
      deskflow::bridge::CdcTransport cdc(QString::fromStdString(port));
      // Use permissive open to detect if device is in firmware mode (any FW)
      if (cdc.open(true)) {
        // Handshake succeeded -> We are in Firmware Mode!
        // Check if it is Factory Mode
        const auto &config = cdc.deviceConfig();
        if (config.firmwareMode == deskflow::bridge::FirmwareMode::Factory) {
          QMetaObject::invokeMethod(this, [this]() {
            log(tr("Device is already running with factory firmware."));
            showWideMessageBox(
                QMessageBox::Information, tr("Info"),
                tr("Device is already running with factory firmware.")
            );
          });
          return;
        } else {
          // App Mode
          QMetaObject::invokeMethod(this, [this]() {
            log(tr("Device is running Application Firmware."));
            showWideMessageBox(
                QMessageBox::Warning, tr("Wrong Mode"),
                tr("Device is running Application Firmware. Please enter Bootloader mode to flash Factory Firmware.")
            );
          });
          return;
        }
      }
      // If open() failed, we assume it's because the device is in Bootloader mode (no handshake support)
      // and proceed to try flashing.
    }

    // Note: This calls the blocking C++ API
    if (data.empty()) {
      QMetaObject::invokeMethod(this, [this]() {
        log(tr("Error: No factory package selected."));
        showWideMessageBox(QMessageBox::Warning, tr("Error"), tr("Please select a factory package file to flash."));
      });
      return;
    }

    log(tr("Starting Factory Flash..."));
    auto replug_cb = createReplugCallback();
    FlashResult res = flash_factory(port, data, info, progress_cb, log_cb, replug_cb);

    // Update UI on main thread
    QMetaObject::invokeMethod(this, [this, res, info]() {
      if (res == FlashResult::OK) {
        log(tr("Factory Flash Success!"));
        log(tr("Device Info: %1").arg(QString::fromStdString(info)));
        showFactoryFlashSuccess();
      } else {
        log(tr("Flash failed, %1").arg(QString::fromStdString(flashResultToString(res))));
      }
    });
  };

  runBackgroundTask(task);
}

