lockekk/dshare-hid/src/lib/gui/widgets/Esp32HidToolsWidget.cpp
void Esp32HidToolsWidget::onDownloadAndFlashFactory()
{
  QString portName = m_portCombo->currentData().toString();
  if (portName.isEmpty()) {
    portName = m_portCombo->currentText();
    if (portName.isEmpty() || portName == tr("No devices found")) {
      showWideMessageBox(QMessageBox::Warning, tr("Error"), tr("Please select a valid serial port."));
      return;
    }
  }

  log(tr("Checking for latest factory firmware..."));
  std::string port = portName.toStdString();

  auto fetchTask = [this, port]() {
    GithubDownloader downloader("lockekk", "esp32-hid-release");
    auto assets = downloader.get_latest_assets();
    std::string assetName;
    for (const auto &asset : assets) {
      if (asset.name.length() >= 5 && asset.name.compare(asset.name.length() - 5, 5, ".fzip") == 0) {
        assetName = asset.name;
        break;
      }
    }

    QMetaObject::invokeMethod(this, [this, assetName, port]() {
      if (assetName.empty()) {
        log(tr("Failed to find factory firmware in the latest release."));
        showWideMessageBox(QMessageBox::Critical, tr("Error"), tr("Failed to find factory firmware."));
        return;
      }

      log(tr("Found factory firmware: %1").arg(QString::fromStdString(assetName)));

      if (!confirmFactoryFlash(QString::fromStdString(assetName))) {
        log(tr("Factory flash cancelled."));
        return;
      }

      log(tr("Starting Download & Flash process..."));

      auto flashTask = [this, port, assetName]() {
        QMetaObject::invokeMethod(this, [this, assetName]() {
          log(tr("Downloading %1...").arg(QString::fromStdString(assetName)));
        });

        GithubDownloader downloader("lockekk", "esp32-hid-release");
        auto dataOpt = downloader.download_asset_to_memory(assetName);
        if (!dataOpt.has_value()) {
          QMetaObject::invokeMethod(this, [this]() {
            log(tr("Download failed."));
            showWideMessageBox(
                QMessageBox::Critical, tr("Error"), tr("Failed to download firmware. Check internet connection.")
            );
          });
          return;
        }

        std::vector<uint8_t> data = dataOpt.value();
        QMetaObject::invokeMethod(this, [this, dataSize = data.size()]() {
          log(tr("Download complete. Size: %1 bytes").arg(dataSize));
          log(tr("Starting flashing process..."));
        });

        // 2. Flash
        std::string info;
        auto log_cb = [this](const std::string &msg) {
          QMetaObject::invokeMethod(this, [this, msg]() { log(QString::fromStdString(msg)); });
        };

        auto progress_cb = [this](size_t written, size_t total, size_t address) {
          static int last_percent = -1;
          int percent = (int)(((float)written / total) * 100);
          if (percent % 10 == 0 && percent != last_percent) {
            last_percent = percent;
            QString msg = QString("Flashing... %1%").arg(percent);
            QMetaObject::invokeMethod(this, [this, msg]() { log(msg); });
          }
        };

        // Pre-check handshake
        {
          deskflow::bridge::CdcTransport cdc(QString::fromStdString(port));
          if (cdc.open(true)) {
            const auto &config = cdc.deviceConfig();
            if (config.firmwareMode == deskflow::bridge::FirmwareMode::Factory) {
              QMetaObject::invokeMethod(this, [this]() {
                showWideMessageBox(
                    QMessageBox::Information, tr("Info"), tr("Device is already running factory firmware.")
                );
              });
              return;
            } else {
              QMetaObject::invokeMethod(this, [this]() {
                log(tr("Device is in App Mode. Please enter Bootloader Mode."));
                showWideMessageBox(
                    QMessageBox::Warning, tr("Wrong Mode"),
                    tr("Please enter Bootloader mode to flash Factory Firmware.")
                );
              });
              return;
            }
          }
        }

        auto replug_cb = createReplugCallback();
        FlashResult res = flash_factory(port, data, info, progress_cb, log_cb, replug_cb);

        QMetaObject::invokeMethod(this, [this, res, info]() {
          if (res == FlashResult::OK) {
            log(tr("Flash Success!"));
            log(tr("Device Info: %1").arg(QString::fromStdString(info)));
            showFactoryFlashSuccess();
          } else {
            QString errorMsg = QString::fromStdString(flashResultToString(res));
            log(tr("Flash failed, %1").arg(errorMsg));
            showWideMessageBox(QMessageBox::Critical, tr("Error"), tr("Flash failed, %1").arg(errorMsg));
          }
        });
      };
      runBackgroundTask(flashTask);
    });
  };
  runBackgroundTask(fetchTask);
}

std::function<void()> Esp32HidToolsWidget::createReplugCallback()
{
  return [this]() {
    QMetaObject::invokeMethod(
        this,
        [this]() {
          log(tr("Waiting for user to reconnect device..."));
          QMessageBox msgBox(
              QMessageBox::Warning, tr("Reconnect Device"), tr("Please disconnect and reconnect the device now."),
              QMessageBox::NoButton, this
          );
          msgBox.addButton(tr("I have reconnected the device"), QMessageBox::AcceptRole);
          msgBox.exec();
          log(tr("User confirmed reconnection."));
        },
        Qt::BlockingQueuedConnection
    );
  };
}

int Esp32HidToolsWidget::showWideMessageBox(
    QMessageBox::Icon icon, const QString &title, const QString &text, QMessageBox::StandardButtons buttons
)
{
  QMessageBox msgBox(icon, title, text, buttons, this);
  // Force the dialog to be 500px wide for readability.
  // We use a stylesheet to prevent macOS native override of the layout.
  msgBox.setStyleSheet("QMessageBox { min-width: 500px; }");
  if (auto *layout = qobject_cast<QGridLayout *>(msgBox.layout())) {
    auto *spacer = new QSpacerItem(500, 0, QSizePolicy::Fixed, QSizePolicy::Fixed);
    layout->addItem(spacer, layout->rowCount(), 0, 1, layout->columnCount());
  }
  return msgBox.exec();
}

