lockekk/dshare-hid/src/lib/gui/widgets/Esp32HidToolsWidget.cpp
bool Esp32HidToolsWidget::confirmFactoryFlash(const QString &filename)
{
  QString message = tr("About to flash: <b>%1</b><br><br>"
                       "This action will permanently convert your device to DShare-HID. "
                       "This process is irreversible and precludes non-DShare firmware.<br><br>Proceed?")
                        .arg(filename);

  return (
      showWideMessageBox(
          QMessageBox::Question, tr("Confirm Factory Flash"), message, QMessageBox::Yes | QMessageBox::No
      ) == QMessageBox::Yes
  );
}

void Esp32HidToolsWidget::showFactoryFlashSuccess()
{
  QString msg = tr("Firmware flashed successfully.\n\n"
                   "The device will boot into a 7-day free trial automatically. "
                   "After the trial expires, use the Activation tab to activate with a license key.");

  showWideMessageBox(QMessageBox::Information, tr("Success"), msg);
}

// Check Upgrade
void Esp32HidToolsWidget::onCheckUpgrade()
{
  QString portName = m_portCombo->currentData().toString();
  if (portName.isEmpty()) {
    portName = m_portCombo->currentText();
    if (portName.isEmpty() || portName == tr("No devices found")) {
      showWideMessageBox(QMessageBox::Warning, tr("Error"), tr("Please select a valid serial port."));
      return;
    }
  }

  log(tr("Checking for upgrades..."));
  std::string port = portName.toStdString();

  auto task = [this, port]() {
    // Check for "dshare-hid" / "dshare-hid-release"
    GithubDownloader downloader("lockekk", "esp32-hid-release");
    auto latestTag = downloader.get_latest_tag();
    if (latestTag.empty()) {
      QMetaObject::invokeMethod(this, [this]() {
        log(tr("Failed to fetch latest version tag from GitHub."));
        showWideMessageBox(QMessageBox::Warning, tr("Network Error"), tr("Could not check for updates."));
      });
      return;
    }

    // Connect to device to get current version
    QString portName = m_portCombo->currentData().toString();
    if (portName.isEmpty()) {
      portName = m_portCombo->currentText();
    }

    QString deviceVer = "Unknown";
    bool deviceAvailable = false;
    uint8_t rawBcd = 0;

    deskflow::bridge::CdcTransport cdc(portName);
    if (cdc.open()) {
      if (cdc.hasDeviceConfig()) {
        auto config = cdc.deviceConfig();
        rawBcd = config.firmwareVersionBcd;
        // Interpret as decimal: 101 -> 1.0.1, 200 -> 2.0.0
        int major = rawBcd / 100;
        int minor = (rawBcd % 100) / 10;
        int patch = rawBcd % 10;
        deviceVer = QString("v%1.%2.%3").arg(major).arg(minor).arg(patch);
        deviceAvailable = true;
      } else {
        QMetaObject::invokeMethod(this, [this]() {
          log(tr("Device handshake failed or no config received. Assuming factory/unknown state."));
        });
      }
    } else {
      QMetaObject::invokeMethod(this, [this]() { log(tr("Could not open device. Assuming factory/unknown state.")); });
    }

    // Log info for debugging
    QMetaObject::invokeMethod(this, [this, latestTag, deviceVer, rawBcd]() {
      LOG_INFO(
          "Version Check: Remote Tag='%s', Device Version='%s' (Raw BCD=%d)", latestTag.c_str(), qPrintable(deviceVer),
          rawBcd
      );
    });

    // Parse versions
    auto parseVersion = [](const std::string &v) {
      int major = 0, minor = 0, patch = 0;
      if (v.empty() || v == "Unknown")
        return std::make_tuple(0, 0, 0);

      size_t start = (v[0] == 'v') ? 1 : 0;
      // Find first dot
      size_t dot1 = v.find('.', start);
      if (dot1 != std::string::npos) {
        try {
          major = std::stoi(v.substr(start, dot1 - start));
        } catch (...) {
        }
        size_t dot2 = v.find('.', dot1 + 1);
        if (dot2 != std::string::npos) {
          try {
            minor = std::stoi(v.substr(dot1 + 1, dot2 - (dot1 + 1)));
          } catch (...) {
          }
          try {
            patch = std::stoi(v.substr(dot2 + 1));
          } catch (...) {
          }
        } else {
          try {
            minor = std::stoi(v.substr(dot1 + 1));
          } catch (...) {
          }
        }
      } else {
        try {
          major = std::stoi(v.substr(start));
        } catch (...) {
        }
      }
      return std::make_tuple(major, minor, patch);
    };

    auto [tagMajor, tagMinor, tagPatch] = parseVersion(latestTag);
    auto [devMajor, devMinor, devPatch] = parseVersion(deviceVer.toStdString());

    QMetaObject::invokeMethod(this, [=, this]() {
      m_lblCurrentVersion->setText(tr("Current Version: %1").arg(deviceVer));
      m_lblLatestVersion->setText(tr("Latest Version: %1").arg(QString::fromStdString(latestTag)));

      bool updateAvailable = false;

      // If device is not available or unknown, we assume update is possible/needed
      if (!deviceAvailable || deviceVer == "Unknown") {
        updateAvailable = true;
      } else {
        if (tagMajor > devMajor)
          updateAvailable = true;
        else if (tagMajor == devMajor && tagMinor > devMinor)
          updateAvailable = true;
        else if (tagMajor == devMajor && tagMinor == devMinor && tagPatch > devPatch)
          updateAvailable = true;
      }

      if (updateAvailable) {
        if (deviceVer != "Unknown") {
          log(tr("Update available (%1 > %2).").arg(QString::fromStdString(latestTag)).arg(deviceVer));
        } else {
          log(tr("Update available (Device version unknown)."));
        }

        if (cdc.deviceConfig().hasOtaPartition) {
          m_onlineFlashAllowed = true;
          m_flashOnlineBtn->setEnabled(true);
          m_flashOnlineBtn->setToolTip("");
        } else {
          m_onlineFlashAllowed = false;
          m_flashOnlineBtn->setEnabled(false);
          m_flashOnlineBtn->setToolTip(tr("Please flash per-device firmware firstly."));
          log(tr("Online flashing disabled: Device missing OTA partition."));
        }
      } else {
        log(tr("Device is up to date."));
      }
    });
  };

  runBackgroundTask(task);
}

void Esp32HidToolsWidget::onFlashLocal()
{
  QString path = m_upgradePathEdit->text();
  if (path.isEmpty()) {
    showWideMessageBox(QMessageBox::Warning, tr("Error"), tr("Please select a firmware file."));
    return;
  }

  std::vector<uint8_t> data = readFile(path);
  if (data.empty()) {
    showWideMessageBox(QMessageBox::Critical, tr("Error"), tr("Failed to read firmware file."));
    return;
  }

  log(tr("Reading local firmware from: %1").arg(path));
  log(tr("Flashing local file: %1").arg(path));
  flashFirmware(data);
}

