lockekk/dshare-hid/src/lib/gui/widgets/Esp32HidToolsWidget.cpp
void Esp32HidToolsWidget::onFlashOnline()
{
  log(tr("Downloading upgrade firmware..."));

  // We need to fetch data first, then flash.
  // We can reuse runBackgroundTask for download + flash chain.

  auto task = [this]() {
    GithubDownloader downloader("lockekk", "esp32-hid-release");
    auto assets = downloader.get_latest_assets();
    std::string assetName;
    for (const auto &asset : assets) {
      if (asset.name.length() >= 5 && asset.name.compare(asset.name.length() - 5, 5, ".uzip") == 0) {
        assetName = asset.name;
        break;
      }
    }

    if (assetName.empty()) {
      QMetaObject::invokeMethod(this, [this]() {
        log(tr("Download failed. No .uzip asset found."));
        showWideMessageBox(
            QMessageBox::Critical, tr("Error"), tr("Failed to find upgrade firmware in the latest release.")
        );
      });
      return;
    }

    QMetaObject::invokeMethod(this, [this, assetName]() {
      log(tr("Found upgrade firmware: %1").arg(QString::fromStdString(assetName)));
      log(tr("Downloading %1...").arg(QString::fromStdString(assetName)));
    });

    auto dl = downloader.download_asset_to_memory(assetName);

    QMetaObject::invokeMethod(this, [this, dl]() {
      if (!dl.has_value()) {
        log(tr("Download failed."));
        showWideMessageBox(QMessageBox::Critical, tr("Error"), tr("Failed to download firmware."));
        return;
      }
      log(tr("Download complete. Starting flash..."));
      flashFirmware(dl.value());
    });
  };

  runBackgroundTask(task);
}

void Esp32HidToolsWidget::flashFirmware(const std::vector<uint8_t> &firmwareData)
{
  QString portName = m_portCombo->currentData().toString();
  if (portName.isEmpty()) {
    portName = m_portCombo->currentText();
  }

  // Local copy to capture by value
  std::vector<uint8_t> dataCopy = firmwareData;

  auto task = [this, portName, dataCopy]() mutable {
    auto log_cb_func = [this](const std::string &msg) {
      QMetaObject::invokeMethod(this, [this, msg]() { this->log(QString::fromStdString(msg)); });
    };

    std::string portStd = portName.toStdString();
    deskflow::bridge::CdcTransport cdc(portName);

    // 2. Switch to Factory if needed
    if (!cdc.open()) {
      // Proceed or fail?
      // If we can't open, we might fail to check mode.
      // But maybe we can proceed with upgrade assuming it might be in download mode?
      // No, upgrade requires app or factory mode.
    }

    // Check mode
    // ... reused logic ...
    bool inFactory = false;
    if (cdc.isOpen()) {
      if (cdc.hasDeviceConfig() && cdc.deviceConfig().firmwareMode == deskflow::bridge::FirmwareMode::Factory) {
        inFactory = true;
      } else {
        // App mode, try switching
        if (cdc.gotoFactory()) {
          log_cb_func("Sent gotoFactory command. Waiting for device to reboot...");
          cdc.close(); // Close to allow re-enumeration

          // Poll for reconnection
          bool reconnected = false;
          for (int i = 0; i < 30; i++) { // 15 seconds
            std::this_thread::sleep_for(std::chrono::milliseconds(500));
            // Try open - probe needs QString
            deskflow::bridge::CdcTransport probe(portName);
            if (probe.open(true)) {
              if (probe.hasDeviceConfig() &&
                  probe.deviceConfig().firmwareMode == deskflow::bridge::FirmwareMode::Factory) {
                reconnected = true;
                break;
              }
            }
          }

          if (reconnected) {
            log_cb_func("Device re-connected in Factory Mode.");
            std::this_thread::sleep_for(std::chrono::milliseconds(500));
          } else {
            log_cb_func("Warning: Timed out waiting for device to reconnect.");
          }
        }
      }
    }

    cdc.close(); // Validate flash tool opens it fresh

    // 3. Flash
    auto progress_cb = [this](size_t written, size_t total, size_t address) {
      static int last_percent = -1;
      int percent = total > 0 ? (int)(((float)written / total) * 100) : 0;
      if (percent != last_percent && percent % 10 == 0) {
        QMetaObject::invokeMethod(this, [this, percent]() { log(tr("Flashing... %1%").arg(percent)); });
        last_percent = percent;
      }
    };

    try {
      FlashResult res = flash_upgrade(portStd, dataCopy, progress_cb, log_cb_func);
      if (res == FlashResult::OK) {
        log_cb_func("Upgrade flash complete.");
        QMetaObject::invokeMethod(this, [this]() {
          showWideMessageBox(QMessageBox::Information, tr("Success"), tr("Firmware upgrade successful."));
        });
      } else {
        QString errorMsg = QString::fromStdString(flashResultToString(res));
        log_cb_func(tr("Flash failed, %1").arg(errorMsg).toStdString()
        ); // log_cb takes std::string, but log takes QString. log_cb calls log.
        QMetaObject::invokeMethod(this, [this, errorMsg]() {
          showWideMessageBox(QMessageBox::Critical, tr("Error"), tr("Flash failed, %1").arg(errorMsg));
        });
      }
    } catch (const std::exception &e) {
      log_cb_func(std::string("Flash failed: ") + e.what());
      QMetaObject::invokeMethod(this, [this, e]() {
        showWideMessageBox(QMessageBox::Critical, tr("Error"), tr("Flash failed: %1").arg(e.what()));
      });
    }
  };

  runBackgroundTask(task);
}

void Esp32HidToolsWidget::reject()
{
  if (m_isTaskRunning) {
    return;
  }
  QDialog::reject();
}
void Esp32HidToolsWidget::changeEvent(QEvent *event)
{
  QDialog::changeEvent(event);
  if (event->type() == QEvent::LanguageChange) {
    updateText();
  }
}

void Esp32HidToolsWidget::updateText()
{
  if (m_devicePath.isEmpty()) {
    setWindowTitle(tr("Firmware Flash Tool"));
  } else {
    setWindowTitle(tr("Firmware Flash Tool - %1").arg(m_devicePath));
  }

  m_refreshPortsBtn->setText(tr("Refresh"));

  m_tabWidget->setTabText(0, tr("Factory Mode"));
  m_tabWidget->setTabText(1, tr("Upgrade Mode"));
  m_tabWidget->setTabText(2, tr("Activation"));
  m_tabWidget->setTabText(3, tr("Order"));

  m_factoryPathEdit->setPlaceholderText(tr("Path to factory.fzip"));
  m_factoryBrowseBtn->setText(tr("Browse..."));
  m_factoryFlashBtn->setText(tr("Flash"));
  m_downloadFlashBtn->setText(tr("Flash"));

  m_checkUpgradeBtn->setText(tr("Check for Updates"));
  m_flashOnlineBtn->setText(tr("Flash"));
  m_upgradePathEdit->setPlaceholderText(tr("Path to upgrade.uzip"));
  m_upgradeBrowseBtn->setText(tr("Browse..."));
  m_flashLocalBtn->setText(tr("Flash"));

