lockekk/dshare-hid/src/lib/gui/widgets/Esp32HidToolsWidget.cpp
  m_btnCopySerial->setText(tr("Copy Serial"));
  m_lineActivationKey->setPlaceholderText(tr("Paste Activation Key Here"));
  m_btnActivate->setText(tr("Activate"));

  m_orderOption2->setText(tr("Purchase Full License"));
  m_orderOption4->setText(tr("Already licensed, but want bump profiles"));

  m_chkManualPayment->setText(tr("I will arrange payment via email"));
  m_btnCopyOrder->setText(tr("Copy content"));
  m_btnEmailOrder->setText(tr("Email"));

  // Update dynamic labels that might have "Unknown" or similar markers
  m_lblCurrentVersion->setText(tr("Current Version: %1").arg(m_lblCurrentVersion->text().split(": ").last()));
  m_lblLatestVersion->setText(tr("Latest Version: %1").arg(m_lblLatestVersion->text().split(": ").last()));
  m_labelActivationState->setText(tr("State: %1").arg(m_labelActivationState->text().split(": ").last()));
}

} // namespace deskflow::gui

void deskflow::gui::Esp32HidToolsWidget::onTabChanged(int index)
{
  if (index < 0)
    return;

  QString title = m_tabWidget->tabText(index);
  if (title == tr("Activation") || title == tr("Order")) {
    refreshDeviceState();
  }

  // Dynamically adjust splitter sizes to avoid scrollbars while maximizing log space
  // Order tab needs more space (~650px) for full content
  if (title == tr("Order")) {
    m_splitter->setSizes({650, 350});
  } else {
    m_splitter->setSizes({300, 700});
  }
}

void deskflow::gui::Esp32HidToolsWidget::refreshDeviceState()
{
  QString portName = m_portCombo->currentData().toString();
  if (portName.isEmpty()) {
    portName = m_portCombo->currentText();
    if (portName.isEmpty() || portName == tr("No devices found")) {
      return;
    }
  }

  log(tr("Refreshing device state..."));
  m_lineSerial->clear();
  m_orderSerialLabel->setText(tr("-"));
  m_labelActivationState->setText(tr("State: Checking..."));
  setControlsEnabled(false); // Disable while checking

  auto task = [this, portName]() {
    deskflow::bridge::CdcTransport cdc(portName);
    std::string serial;
    // Use permissive open for status check (Factory FW might not support auth)
    bool openSuccess = cdc.open(true);

    struct State
    {
      QString serial;
      QString activationState;
      deskflow::bridge::ActivationState stateEnum;
      bool isActivated;
      bool isFactoryMode;
      uint8_t totalProfiles;
      bool success;
      QString error;
    } result;

    if (openSuccess) {
      if (cdc.fetchSerialNumber(serial)) {
        result.serial = QString::fromStdString(serial);
      }

      const auto &config = cdc.deviceConfig();
      result.activationState = QString::fromLatin1(config.activationStateString());
      result.stateEnum = config.activationState;
      result.isActivated = (config.activationState == deskflow::bridge::ActivationState::Activated);
      result.isFactoryMode = (config.firmwareMode == deskflow::bridge::FirmwareMode::Factory);
      result.totalProfiles = config.totalProfiles;
      result.success = true;
    } else {
      result.success = false;
      result.error = QString::fromStdString(cdc.lastError());
    }

    QMetaObject::invokeMethod(this, [this, result]() {
      setControlsEnabled(true);
      if (result.success) {
        m_lineSerial->setText(result.serial);
        m_orderSerialLabel->setText(result.serial);
        m_labelActivationState->setText(
            tr("State: %1, %2 Profiles").arg(result.activationState).arg(result.totalProfiles)
        );

        // Update Order Options
        bool isLicensed = result.isActivated;

        m_orderOption2->setEnabled(!isLicensed);
        m_orderOption4->setEnabled(isLicensed && result.totalProfiles == 2);

        // Check the first valid (enabled) option
        if (m_orderOption2->isEnabled()) {
          m_orderOption2->setChecked(true);
        } else if (m_orderOption4->isEnabled()) {
          m_orderOption4->setChecked(true);
        }

        m_orderTotalProfiles->clear();
        if (result.isActivated) {
          if (result.totalProfiles == 2) {
            m_orderTotalProfiles->addItem("4", 4);
            m_orderTotalProfiles->addItem("6", 6);
            m_orderTotalProfiles->setEnabled(true);
          } else {
            m_orderTotalProfiles->addItem(QString::number(result.totalProfiles), result.totalProfiles);
            m_orderTotalProfiles->setEnabled(false);
          }
        } else {
          m_orderTotalProfiles->addItem("2", 2);
          m_orderTotalProfiles->addItem("4", 4);
          m_orderTotalProfiles->addItem("6", 6);
          m_orderTotalProfiles->setEnabled(result.totalProfiles == 4);
        }

        if (result.isFactoryMode) {
          m_labelActivationState->setText(tr("State: Factory Mode (Cannot Activate)"));
          m_groupActivationInput->setVisible(false);
          log(tr("Device State Refreshed. Serial: %1, Mode: Factory").arg(result.serial));
        } else {
          // Conditional UI: Hide activation input if already activated
          // Conditional UI: Hide activation input if already activated AND has more than 2 profiles
          // (i.e. allow upgrade if profiles == 2)
          if (!result.isActivated || result.totalProfiles == 2) {
            m_groupActivationInput->setVisible(true);
          } else {
            m_groupActivationInput->setVisible(false);
          }
          log(tr("Device State Refreshed. Serial: %1, State: %2, Profiles: %3")
                  .arg(result.serial, result.activationState, QString::number(result.totalProfiles)));
        }
      } else {
        m_labelActivationState->setText(tr("State: Error"));
        log(tr("Failed to refresh state: %1").arg(result.error));

        // Erased Device Case: If on Order tab and handshake failed, warn user
        QTabWidget *tabs = findChild<QTabWidget *>();
        if (tabs && tabs->tabText(tabs->currentIndex()) == tr("Order")) {
          QMessageBox::warning(
              this, tr("Erased Device Detected"),
              tr("No valid firmware detected on the device. Please go to the 'Factory Mode' tab and flash 'Online' "
                 "first.")
          );
        }
        // Reset Order Options
        m_orderOption2->setEnabled(false);
        m_orderOption4->setEnabled(false);
        m_orderTotalProfiles->setEnabled(false);
      }
    });
  };
  m_isTaskRunning = true;
  QApplication::setOverrideCursor(Qt::WaitCursor);
  auto *watcher = new QFutureWatcher<void>(this);
  connect(watcher, &QFutureWatcher<void>::finished, this, [this, watcher]() {
    QApplication::restoreOverrideCursor();
    m_isTaskRunning = false;
    watcher->deleteLater();
  });
  QFuture<void> future = QtConcurrent::run(task);
  watcher->setFuture(future);
}

