lockekk/dshare-hid/src/lib/gui/widgets/Esp32HidToolsWidget.cpp
void deskflow::gui::Esp32HidToolsWidget::onCopySerialClicked()
{
  QString serial = m_lineSerial->text();
  if (!serial.isEmpty()) {
    QApplication::clipboard()->setText(serial);
    log(tr("Serial number copied to clipboard."));
  }
}

void deskflow::gui::Esp32HidToolsWidget::onActivateClicked()
{
  QString portName = m_portCombo->currentData().toString();
  if (portName.isEmpty()) {
    portName = m_portCombo->currentText();
    if (portName.isEmpty() || portName == tr("No devices found")) {
      showWideMessageBox(QMessageBox::Warning, tr("Error"), tr("Please select a valid serial port."));
      return;
    }
  }

  QString key = m_lineActivationKey->text().trimmed();
  if (key.isEmpty()) {
    showWideMessageBox(QMessageBox::Warning, tr("Error"), tr("Please enter an activation key."));
    return;
  }

  log(tr("Activating device..."));

  auto task = [this, portName, key]() {
    deskflow::bridge::CdcTransport cdc(portName);
    // Activation REQUIRES secure connection.
    if (cdc.open(false) && cdc.activateDevice(key.toStdString())) {
      QMetaObject::invokeMethod(this, [this]() {
        log(tr("Activation successful!"));
        showWideMessageBox(QMessageBox::Information, tr("Success"), tr("Device activated successfully."));
        refreshDeviceState(); // Refresh to update UI
      });
    } else {
      // User requested minimal error message
      QString detailedError = QString::fromStdString(cdc.lastError());
      if (!detailedError.isEmpty()) {
        LOG_WARN("Activation detailed error: %s", qPrintable(detailedError));
      }
      QMetaObject::invokeMethod(this, [this]() {
        log(tr("Activation failed."));
        showWideMessageBox(QMessageBox::Critical, tr("Error"), tr("Activation failed."));
      });
    }
  };
  runBackgroundTask(task);
}

QString deskflow::gui::Esp32HidToolsWidget::composeOrderContent(QString &outPrefix, int &outOption)
{
  QString name = m_orderName->text().trimmed();
  QString email = m_orderEmail->text().trimmed();

  if (name.isEmpty() || email.isEmpty()) {
    showWideMessageBox(QMessageBox::Warning, tr("Input Required"), tr("Please enter your name and email address."));
    return QString();
  }

  QString serial = m_orderSerialLabel->text();
  int totalProfiles = m_orderTotalProfiles->currentData().toInt();

  if (serial == tr("-") || serial.isEmpty()) {
    showWideMessageBox(
        QMessageBox::Warning, tr("Device Error"), tr("Serial number missing. Please check device connection.")
    );
    return QString();
  }

  outOption = -1;
  QString content;

  if (m_orderOption2->isChecked()) {
    outOption = 2;
    outPrefix = "full_license_";
    content = QString("Name: %1\nEmail: %2\nSerial: %3\nTotal Profiles: %4\nRequest: Purchase full license\n")
                  .arg(name, email, serial, QString::number(totalProfiles));
  } else if (m_orderOption4->isChecked()) {
    outOption = 4;
    outPrefix = "profile_";
    content =
        QString("Name: %1\nEmail: %2\nSerial: %3\nTotal Profiles: %4\nRequest: Bump profiles (Already licensed)\n")
            .arg(name, email, serial, QString::number(totalProfiles));
  } else {
    showWideMessageBox(QMessageBox::Warning, tr("Selection Required"), tr("Please select one of the order options."));
    return QString();
  }

  OrderPrice priceInfo = calculateOrderPrice(outOption, totalProfiles);
  double price = priceInfo.price;
  QString priceDesc = priceInfo.desc;

  content.append(QString("Payment Details: %1 = Total $%2 USD\n").arg(priceDesc, QString::number(price, 'f', 2)));
  content.append(QString("Paypal Seller: %1\n").arg(DESKFLOW_PAYPAL_ACCOUNT));

  if (price > 0.01) {
    if (!m_chkManualPayment->isChecked()) {
      QString transId = m_paymentTransId->text().trimmed();
      if (transId.isEmpty()) {
        showWideMessageBox(
            QMessageBox::Warning, tr("Missing Transaction ID"),
            tr("Please enter your PayPal Transaction ID for verification.")
        );
        return QString();
      }
      content.append(QString("PayPal Transaction ID: %1\n").arg(transId));
    } else {
      content.append(QString("Payment Method: Manual / Email Arrangement\n"));
    }
  }

  content.append(QString("Reference No: %1\n").arg(m_paymentRefNo->text()));

  return content;
}

deskflow::gui::OrderPrice deskflow::gui::Esp32HidToolsWidget::calculateOrderPrice(int option, int totalProfiles)
{
  double price = 0.0;
  QString priceDesc;

  if (option == 2) { // Full License
    price += m_prices.license;

    if (totalProfiles == 4) {
      price += m_prices.profile_4;
    } else if (totalProfiles == 6) {
      price += m_prices.profile_6;
    }

    double discount = 0.0;
    if (totalProfiles > 2 && m_prices.combo_discount > 0.0) {
      discount = m_prices.combo_discount;
      price -= discount;
      if (price < 0)
        price = 0; // Safety
    }

    priceDesc = QString("License($%1) + %2 Profiles(%3)")
                    .arg(QString::number(m_prices.license, 'f', 2))
                    .arg(totalProfiles)
                    .arg(
                        totalProfiles == 2
                            ? "$0.00"
                            : (totalProfiles == 4 ? QString("$%1").arg(QString::number(m_prices.profile_4, 'f', 2))
                                                  : QString("$%1").arg(QString::number(m_prices.profile_6, 'f', 2)))
                    );

    if (discount > 0.0) {
      priceDesc += QString(" - Combo Discount($%1)").arg(QString::number(discount, 'f', 2));
    }

  } else if (option == 4) { // Only Bump Profiles
    if (totalProfiles == 4)
      price += m_prices.profile_4;
    else if (totalProfiles == 6)
      price += m_prices.profile_6;

    priceDesc = QString("Upgrade profiles to %1 (%2)")
                    .arg(totalProfiles)
                    .arg(
                        totalProfiles == 2
                            ? "$0.00"
                            : (totalProfiles == 4 ? QString("$%1").arg(QString::number(m_prices.profile_4, 'f', 2))
                                                  : QString("$%1").arg(QString::number(m_prices.profile_6, 'f', 2)))
                    );
  }

  return {price, priceDesc};
}

void deskflow::gui::Esp32HidToolsWidget::updatePaymentDetails()
{
  int option = -1;
  if (m_orderOption2->isChecked())
    option = 2;
  else if (m_orderOption4->isChecked())
    option = 4;

