lockekk/dshare-hid/src/lib/gui/widgets/Esp32HidToolsWidget.cpp
  int totalProfiles = m_orderTotalProfiles->currentData().toInt();
  OrderPrice priceInfo = calculateOrderPrice(option, totalProfiles);

  if (option == -1) {
    m_lblPaymentDetails->setText("Select an option");
    return;
  }

  m_lblPaymentDetails->setText(
      QString("Payment Details: %1 = Total $%2 USD").arg(priceInfo.desc, QString::number(priceInfo.price, 'f', 2))
  );

  m_lblPaymentOwner->setText(
      QString(tr("Paypal Seller: <b><font color='red'>%1</font></b>")).arg(DESKFLOW_PAYPAL_ACCOUNT)
  );
  m_lblPaymentOwner->setVisible(true);
}

void deskflow::gui::Esp32HidToolsWidget::updatePaymentReference()
{
  // Use UTC timestamp as requested (Cross-platform)
  qint64 timestamp = QDateTime::currentMSecsSinceEpoch();
  m_paymentRefNo->setText(QString::number(timestamp));
}

void deskflow::gui::Esp32HidToolsWidget::onPayNowClicked()
{
  int option = -1;
  if (m_orderOption2->isChecked())
    option = 2;
  else if (m_orderOption4->isChecked())
    option = 4;

  int totalProfiles = m_orderTotalProfiles->currentData().toInt();
  OrderPrice priceInfo = calculateOrderPrice(option, totalProfiles);
  double price = priceInfo.price;
  QString priceDesc = priceInfo.desc;

  if (price <= 0.01) {
    QMessageBox::information(this, tr("Free"), tr("No payment is required for this option."));
    return;
  }

  // Construct PayPal URL
  // Configured via build system (CMake)
#ifndef DESKFLOW_PAYPAL_URL
#define DESKFLOW_PAYPAL_URL "https://www.sandbox.paypal.com/cgi-bin/webscr"
#endif

#ifndef DESKFLOW_PAYPAL_ACCOUNT
#define DESKFLOW_PAYPAL_ACCOUNT "sb-uqhcf48362835@business.example.com"
#endif

  QString baseUrl = DESKFLOW_PAYPAL_URL;
  QString business = DESKFLOW_PAYPAL_ACCOUNT;

  QString refNo = m_paymentRefNo->text();
  if (refNo.isEmpty()) {
    updatePaymentReference();
    refNo = m_paymentRefNo->text();
  }

  QString itemName = QString("DShare-HID: %1").arg(priceDesc);

  QUrlQuery query;
  query.addQueryItem("cmd", "_xclick");
  query.addQueryItem("business", business);
  query.addQueryItem("currency_code", "USD");
  query.addQueryItem("amount", QString::number(price, 'f', 2));
  query.addQueryItem("item_name", itemName);
  query.addQueryItem("custom", refNo);

  QUrl url(baseUrl);
  url.setQuery(query);

  // Confirmation Dialog
  QString msg = tr("You are about to open PayPal to pay <b>$%1 USD</b> to <b>%2</b>.<br><br>"
                   "Product: %3<br>"
                   "Reference: %4<br><br>"
                   "Please confirm to proceed to PayPal.")
                    .arg(QString::number(price, 'f', 2))
                    .arg(business)
                    .arg(itemName)
                    .arg(refNo);

  if (showWideMessageBox(QMessageBox::Question, tr("Confirm Payment"), msg, QMessageBox::Yes | QMessageBox::No) !=
      QMessageBox::Yes) {
    return;
  }

  if (!QDesktopServices::openUrl(url)) {
    showWideMessageBox(
        QMessageBox::Warning, tr("Error"), tr("Failed to open web browser. Please visit PayPal manually.")
    );
  }
}

void deskflow::gui::Esp32HidToolsWidget::onCopyOrderContent()
{
  QString prefix;
  int option;
  QString content = composeOrderContent(prefix, option);
  if (content.isEmpty()) {
    return;
  }

  QApplication::clipboard()->setText(content);
  log(tr("Order content copied to clipboard."));
  showWideMessageBox(QMessageBox::Information, tr("Copied"), tr("Order content successfully copied to clipboard."));
}

void deskflow::gui::Esp32HidToolsWidget::onEmailOrder()
{
  QString prefix;
  int option;
  QString content = composeOrderContent(prefix, option);
  if (content.isEmpty()) {
    return;
  }

  QString serial = m_orderSerialLabel->text();
  QString subject = QString("DShare Order: %1 %2").arg(prefix, serial);

  // URL encode content and subject
  QUrl url(QString("mailto:dshare.hid@gmail.com"));
  QUrlQuery query;
  query.addQueryItem("subject", subject);
  query.addQueryItem("body", content);
  url.setQuery(query);

  if (QDesktopServices::openUrl(url)) {
    log(tr("Email client opened."));
  } else {
    log(tr("Failed to open email client."));
    showWideMessageBox(QMessageBox::Critical, tr("Error"), tr("Failed to open your default email client."));
  }
}

void deskflow::gui::Esp32HidToolsWidget::onPortChanged(int index)
{
  (void)index;
  QString portName = m_portCombo->currentData().toString();
  if (portName.isEmpty()) {
    portName = m_portCombo->currentText();
  }

  LOG_INFO("Port selection changed to: %s", qPrintable(portName));

  // Reset UI metadata
  m_lblCurrentVersion->setText(tr("Current Version: Unknown"));
  m_lblLatestVersion->setText(tr("Latest Version: Unknown"));
  m_flashOnlineBtn->setEnabled(false);
  m_lineSerial->clear();
  m_orderSerialLabel->setText(tr("-"));
  m_labelActivationState->setText(tr("State: Unknown"));

  // Reset Order Options
  m_orderOption2->setEnabled(false);
  m_orderOption4->setEnabled(false);
  m_orderTotalProfiles->setEnabled(false);

  // If on Activation or Order tab, auto-refresh state
  QTabWidget *tabs = findChild<QTabWidget *>();
  if (tabs &&
      (tabs->tabText(tabs->currentIndex()) == tr("Activation") || tabs->tabText(tabs->currentIndex()) == tr("Order"))) {
    refreshDeviceState();
  }
}
